using System;
using System.Collections;
using System.Collections.Generic;

namespace Ex3
{
    class Program
    {
        static void Main(string[] args)
        {
            //3.Переделать программу Пример использования коллекций для решения следующих задач:
            //а) Подсчитать количество студентов учащихся на 5 и 6 курсах;
            //б) подсчитать сколько студентов в возрасте от 18 до 20 лет на каком курсе учатся(*частотный массив);
            //в) отсортировать список по возрасту студента;
            //г) *отсортировать список по курсу и возрасту студента;

            //Владимирова Анастасия.

            FoundationProgram.Print(0, 0, 0, 0, 0, 0, 0, 0, new List<Student>(), DateTime.Now);
        }
    }
}